#!/usr/bin/env python3

from classes import *

#---------------------------------------------------------------------------
#afc1 = afc_device(amplitude,frequency,blocksize,samplerate,
#freq_min,freq_max,freq_step,time_conv)

afc1 = afc_device()

#--настройка ГКЧ------------------------------------------------------------
afc1.amplitude = 0.1 # амплитуда выходного сигнала (у.е.)
afc1.freq_min = 150 # начальная частота качания
afc1.freq_max = 1500 # крнечная частота качания
afc1.freq_step = 25 # шаг частоты
afc1.time_conv = 1 # время измерения на одной частоте

#---------------------------------------------------------------------------

input("Press Enter to exit")
#---------------------------------------------------------------------------
